{
  "files": {
    "model_index.json": {
      "_class_name": "FluxPipeline",
      "_diffusers_version": "0.30.0.dev0",
      "scheduler": [
        "diffusers",
        "FlowMatchEulerDiscreteScheduler"
      ],
      "text_encoder": [
        "transformers",
        "CLIPTextModel"
      ],
      "text_encoder_2": [
        "transformers",
        "T5EncoderModel"
      ],
      "tokenizer": [
        "transformers",
        "CLIPTokenizer"
      ],
      "tokenizer_2": [
        "transformers",
        "T5TokenizerFast"
      ],
      "transformer": [
        "diffusers",
        "FluxTransformer2DModel"
      ],
      "vae": [
        "diffusers",
        "AutoencoderKL"
      ]
    },
    "text_encoder/config.json": {
      "_name_or_path": "openai/clip-vit-large-patch14",
      "architectures": [
        "CLIPTextModel"
      ],
      "attention_dropout": 0.0,
      "bos_token_id": 0,
      "dropout": 0.0,
      "eos_token_id": 2,
      "hidden_act": "quick_gelu",
      "hidden_size": 768,
      "initializer_factor": 1.0,
      "initializer_range": 0.02,
      "intermediate_size": 3072,
      "layer_norm_eps": 1e-05,
      "max_position_embeddings": 77,
      "model_type": "clip_text_model",
      "num_attention_heads": 12,
      "num_hidden_layers": 12,
      "pad_token_id": 1,
      "projection_dim": 768,
      "torch_dtype": "bfloat16",
      "transformers_version": "4.43.3",
      "vocab_size": 49408
    },
    "text_encoder_2/config.json": {
      "_name_or_path": "google/t5-v1_1-xxl",
      "architectures": [
        "T5EncoderModel"
      ],
      "classifier_dropout": 0.0,
      "d_ff": 10240,
      "d_kv": 64,
      "d_model": 4096,
      "decoder_start_token_id": 0,
      "dense_act_fn": "gelu_new",
      "dropout_rate": 0.1,
      "eos_token_id": 1,
      "feed_forward_proj": "gated-gelu",
      "initializer_factor": 1.0,
      "is_encoder_decoder": true,
      "is_gated_act": true,
      "layer_norm_epsilon": 1e-06,
      "model_type": "t5",
      "num_decoder_layers": 24,
      "num_heads": 64,
      "num_layers": 24,
      "output_past": true,
      "pad_token_id": 0,
      "relative_attention_max_distance": 128,
      "relative_attention_num_buckets": 32,
      "tie_word_embeddings": false,
      "torch_dtype": "bfloat16",
      "transformers_version": "4.43.3",
      "use_cache": true,
      "vocab_size": 32128
    },
    "text_encoder_2/model.safetensors.index.json": {
      "metadata": {
        "total_size": 9524621312
      },
      "weight_map": {
        "encoder.block.0.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
        "encoder.block.0.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
        "encoder.block.0.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
        "encoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight": "model-00001-of-00002.safetensors",
        "encoder.block.0.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
        "encoder.block.0.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.0.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00002.safetensors",
        "encoder.block.0.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00002.safetensors",
        "encoder.block.0.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
        "encoder.block.0.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.1.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
        "encoder.block.1.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
        "encoder.block.1.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
        "encoder.block.1.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
        "encoder.block.1.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.1.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00002.safetensors",
        "encoder.block.1.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00002.safetensors",
        "encoder.block.1.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
        "encoder.block.1.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.10.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
        "encoder.block.10.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
        "encoder.block.10.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
        "encoder.block.10.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
        "encoder.block.10.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.10.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00002.safetensors",
        "encoder.block.10.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00002.safetensors",
        "encoder.block.10.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
        "encoder.block.10.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.11.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
        "encoder.block.11.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
        "encoder.block.11.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
        "encoder.block.11.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
        "encoder.block.11.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.11.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00002.safetensors",
        "encoder.block.11.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00002.safetensors",
        "encoder.block.11.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
        "encoder.block.11.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.12.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
        "encoder.block.12.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
        "encoder.block.12.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
        "encoder.block.12.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
        "encoder.block.12.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.12.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00002.safetensors",
        "encoder.block.12.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00002.safetensors",
        "encoder.block.12.layer.1.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
        "encoder.block.12.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.13.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
        "encoder.block.13.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
        "encoder.block.13.layer.0.SelfAttention.q.weight": "model-00002-of-00002.safetensors",
        "encoder.block.13.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
        "encoder.block.13.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.13.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00002.safetensors",
        "encoder.block.13.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00002.safetensors",
        "encoder.block.13.layer.1.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
        "encoder.block.13.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.14.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
        "encoder.block.14.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
        "encoder.block.14.layer.0.SelfAttention.q.weight": "model-00002-of-00002.safetensors",
        "encoder.block.14.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
        "encoder.block.14.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.14.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00002.safetensors",
        "encoder.block.14.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00002.safetensors",
        "encoder.block.14.layer.1.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
        "encoder.block.14.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.15.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
        "encoder.block.15.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
        "encoder.block.15.layer.0.SelfAttention.q.weight": "model-00002-of-00002.safetensors",
        "encoder.block.15.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
        "encoder.block.15.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.15.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00002.safetensors",
        "encoder.block.15.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00002.safetensors",
        "encoder.block.15.layer.1.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
        "encoder.block.15.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.16.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
        "encoder.block.16.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
        "encoder.block.16.layer.0.SelfAttention.q.weight": "model-00002-of-00002.safetensors",
        "encoder.block.16.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
        "encoder.block.16.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.16.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00002.safetensors",
        "encoder.block.16.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00002.safetensors",
        "encoder.block.16.layer.1.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
        "encoder.block.16.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.17.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
        "encoder.block.17.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
        "encoder.block.17.layer.0.SelfAttention.q.weight": "model-00002-of-00002.safetensors",
        "encoder.block.17.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
        "encoder.block.17.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.17.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00002.safetensors",
        "encoder.block.17.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00002.safetensors",
        "encoder.block.17.layer.1.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
        "encoder.block.17.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.18.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
        "encoder.block.18.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
        "encoder.block.18.layer.0.SelfAttention.q.weight": "model-00002-of-00002.safetensors",
        "encoder.block.18.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
        "encoder.block.18.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.18.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00002.safetensors",
        "encoder.block.18.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00002.safetensors",
        "encoder.block.18.layer.1.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
        "encoder.block.18.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.19.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
        "encoder.block.19.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
        "encoder.block.19.layer.0.SelfAttention.q.weight": "model-00002-of-00002.safetensors",
        "encoder.block.19.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
        "encoder.block.19.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.19.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00002.safetensors",
        "encoder.block.19.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00002.safetensors",
        "encoder.block.19.layer.1.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
        "encoder.block.19.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.2.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
        "encoder.block.2.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
        "encoder.block.2.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
        "encoder.block.2.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
        "encoder.block.2.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.2.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00002.safetensors",
        "encoder.block.2.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00002.safetensors",
        "encoder.block.2.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
        "encoder.block.2.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.20.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
        "encoder.block.20.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
        "encoder.block.20.layer.0.SelfAttention.q.weight": "model-00002-of-00002.safetensors",
        "encoder.block.20.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
        "encoder.block.20.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.20.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00002.safetensors",
        "encoder.block.20.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00002.safetensors",
        "encoder.block.20.layer.1.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
        "encoder.block.20.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.21.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
        "encoder.block.21.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
        "encoder.block.21.layer.0.SelfAttention.q.weight": "model-00002-of-00002.safetensors",
        "encoder.block.21.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
        "encoder.block.21.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.21.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00002.safetensors",
        "encoder.block.21.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00002.safetensors",
        "encoder.block.21.layer.1.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
        "encoder.block.21.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.22.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
        "encoder.block.22.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
        "encoder.block.22.layer.0.SelfAttention.q.weight": "model-00002-of-00002.safetensors",
        "encoder.block.22.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
        "encoder.block.22.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.22.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00002.safetensors",
        "encoder.block.22.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00002.safetensors",
        "encoder.block.22.layer.1.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
        "encoder.block.22.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.23.layer.0.SelfAttention.k.weight": "model-00002-of-00002.safetensors",
        "encoder.block.23.layer.0.SelfAttention.o.weight": "model-00002-of-00002.safetensors",
        "encoder.block.23.layer.0.SelfAttention.q.weight": "model-00002-of-00002.safetensors",
        "encoder.block.23.layer.0.SelfAttention.v.weight": "model-00002-of-00002.safetensors",
        "encoder.block.23.layer.0.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.23.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00002.safetensors",
        "encoder.block.23.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00002.safetensors",
        "encoder.block.23.layer.1.DenseReluDense.wo.weight": "model-00002-of-00002.safetensors",
        "encoder.block.23.layer.1.layer_norm.weight": "model-00002-of-00002.safetensors",
        "encoder.block.3.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
        "encoder.block.3.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
        "encoder.block.3.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
        "encoder.block.3.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
        "encoder.block.3.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.3.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00002.safetensors",
        "encoder.block.3.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00002.safetensors",
        "encoder.block.3.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
        "encoder.block.3.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.4.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
        "encoder.block.4.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
        "encoder.block.4.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
        "encoder.block.4.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
        "encoder.block.4.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.4.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00002.safetensors",
        "encoder.block.4.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00002.safetensors",
        "encoder.block.4.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
        "encoder.block.4.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.5.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
        "encoder.block.5.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
        "encoder.block.5.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
        "encoder.block.5.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
        "encoder.block.5.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.5.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00002.safetensors",
        "encoder.block.5.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00002.safetensors",
        "encoder.block.5.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
        "encoder.block.5.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.6.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
        "encoder.block.6.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
        "encoder.block.6.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
        "encoder.block.6.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
        "encoder.block.6.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.6.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00002.safetensors",
        "encoder.block.6.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00002.safetensors",
        "encoder.block.6.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
        "encoder.block.6.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.7.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
        "encoder.block.7.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
        "encoder.block.7.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
        "encoder.block.7.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
        "encoder.block.7.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.7.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00002.safetensors",
        "encoder.block.7.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00002.safetensors",
        "encoder.block.7.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
        "encoder.block.7.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.8.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
        "encoder.block.8.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
        "encoder.block.8.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
        "encoder.block.8.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
        "encoder.block.8.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.8.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00002.safetensors",
        "encoder.block.8.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00002.safetensors",
        "encoder.block.8.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
        "encoder.block.8.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.9.layer.0.SelfAttention.k.weight": "model-00001-of-00002.safetensors",
        "encoder.block.9.layer.0.SelfAttention.o.weight": "model-00001-of-00002.safetensors",
        "encoder.block.9.layer.0.SelfAttention.q.weight": "model-00001-of-00002.safetensors",
        "encoder.block.9.layer.0.SelfAttention.v.weight": "model-00001-of-00002.safetensors",
        "encoder.block.9.layer.0.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.block.9.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00002.safetensors",
        "encoder.block.9.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00002.safetensors",
        "encoder.block.9.layer.1.DenseReluDense.wo.weight": "model-00001-of-00002.safetensors",
        "encoder.block.9.layer.1.layer_norm.weight": "model-00001-of-00002.safetensors",
        "encoder.final_layer_norm.weight": "model-00002-of-00002.safetensors",
        "shared.weight": "model-00001-of-00002.safetensors"
      }
    },
    "transformer/config.json": {
      "_class_name": "FluxTransformer2DModel",
      "_diffusers_version": "0.30.0.dev0",
      "attention_head_dim": 128,
      "guidance_embeds": false,
      "in_channels": 64,
      "joint_attention_dim": 4096,
      "num_attention_heads": 24,
      "num_layers": 19,
      "num_single_layers": 38,
      "patch_size": 1,
      "pooled_projection_dim": 768
    },
    "transformer/diffusion_pytorch_model.safetensors.index.json": {
      "metadata": {
        "total_size": 23782357120
      },
      "weight_map": {
        "context_embedder.bias": "diffusion_pytorch_model-00001-of-00003.safetensors",
        "context_embedder.weight": "diffusion_pytorch_model-00001-of-00003.safetensors",
        "norm_out.linear.bias": "diffusion_pytorch_model-00003-of-00003.safetensors",
        "norm_out.linear.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
        "proj_out.bias": "diffusion_pytorch_model-00003-of-00003.safetensors",
        "proj_out.weight": "diffusion_pytorch_model-00003-of-00003.safetensors",
        "single_transformer_blocks.0.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.0.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.0.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.0.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.0.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.0.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.0.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.0.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.0.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.0.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.0.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.0.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.0.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.0.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.1.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.1.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.1.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.1.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.1.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.1.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.1.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.1.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.1.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.1.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.1.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.1.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.1.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.1.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.10.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.10.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.10.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.10.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.10.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.10.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.10.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.10.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.10.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.10.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.10.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.10.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.10.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.10.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.11.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.11.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.11.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.11.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.11.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.11.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.11.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.11.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.11.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.11.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.11.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.11.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.11.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.11.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.12.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.12.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.12.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.12.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.12.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.12.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.12.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.12.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.12.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.12.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.12.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.12.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.12.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.12.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.13.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.13.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.13.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.13.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.13.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.13.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.13.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.13.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.13.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.13.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.13.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.13.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.13.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.13.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.14.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.14.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.14.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.14.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.14.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.14.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.14.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.14.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.14.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.14.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.14.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.14.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.14.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.14.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.15.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.15.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.15.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.15.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.15.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.15.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.15.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.15.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.15.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.15.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.15.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.15.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.15.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.15.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.16.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.16.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.16.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.16.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.16.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.16.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.16.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.16.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.16.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.16.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.16.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.16.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.16.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.16.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.17.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.17.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.17.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.17.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.17.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.17.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.17.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.17.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.17.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.17.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.17.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.17.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.17.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.17.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.18.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.18.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.18.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.18.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.18.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.18.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.18.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.18.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.18.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.18.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.18.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.18.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.18.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.18.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.19.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.19.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.19.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.19.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.19.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.19.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.19.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.19.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.19.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.19.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.19.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.19.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.19.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.19.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.2.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.2.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.2.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.2.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.2.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.2.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.2.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.2.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.2.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.2.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.2.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.2.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.2.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.2.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.20.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.20.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.20.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.20.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.20.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.20.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.20.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.20.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.20.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.20.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.20.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.20.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.20.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.20.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.21.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.21.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.21.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.21.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.21.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.21.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.21.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.21.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.21.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.21.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.21.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.21.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.21.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.21.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.22.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.22.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.22.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.22.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.22.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.22.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.22.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.22.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.22.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.22.norm.linear.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.22.proj_mlp.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.22.proj_mlp.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.22.proj_out.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.22.proj_out.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.23.attn.norm_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.23.attn.norm_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.23.attn.to_k.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.23.attn.to_k.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.23.attn.to_q.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.23.attn.to_q.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.23.attn.to_v.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.23.attn.to_v.weight": "diffusion_pytorch_model-00002-of-00003.safetensors",
        "single_transformer_blocks.23.norm.linear.bias": "diffusion_pytorch_model-00002-of-00003.safetensors",
