{
  "files": {
    "config.json": {
      "_name_or_path": "/home/linghao/.cache/huggingface/hub/models--meta-llama--Meta-Llama-3.1-8B-Instruct/snapshots/5206a32e0bd3067aef1ce90f5528ade7d866253f",
      "architectures": [
        "LlamaForCausalLM"
      ],
      "attention_bias": false,
      "attention_dropout": 0.0,
      "bos_token_id": 128000,
      "eos_token_id": [
        128001,
        128008,
        128009
      ],
      "hidden_act": "silu",
      "hidden_size": 4096,
      "initializer_range": 0.02,
      "intermediate_size": 14336,
      "max_position_embeddings": 131072,
      "mlp_bias": false,
      "model_type": "llama",
      "num_attention_heads": 32,
      "num_hidden_layers": 32,
      "num_key_value_heads": 8,
      "pretraining_tp": 1,
      "quantization_config": {
        "config_groups": {
          "group_0": {
            "input_activations": {
              "block_structure": null,
              "dynamic": false,
              "group_size": null,
              "num_bits": 8,
              "observer": "minmax",
              "observer_kwargs": {},
              "strategy": "tensor",
              "symmetric": true,
              "type": "float"
            },
            "output_activations": null,
            "targets": [
              "Linear"
            ],
            "weights": {
              "block_structure": null,
              "dynamic": false,
              "group_size": null,
              "num_bits": 8,
              "observer": "minmax",
              "observer_kwargs": {},
              "strategy": "tensor",
              "symmetric": true,
              "type": "float"
            }
          }
        },
        "format": "naive-quantized",
        "global_compression_ratio": 1.4590163747613412,
        "ignore": [
          "lm_head"
        ],
        "kv_cache_scheme": null,
        "quant_method": "compressed-tensors",
        "quantization_status": "frozen"
      },
      "rms_norm_eps": 1e-05,
      "rope_scaling": {
        "factor": 8.0,
        "high_freq_factor": 4.0,
        "low_freq_factor": 1.0,
        "original_max_position_embeddings": 8192,
        "rope_type": "llama3"
      },
      "rope_theta": 500000.0,
      "tie_word_embeddings": false,
      "torch_dtype": "bfloat16",
      "transformers_version": "4.44.0",
      "use_cache": true,
      "vocab_size": 128256
    },
    "model.safetensors.index.json": {
      "metadata": {
        "total_size": 9081201536
      },
      "weight_map": {
        "lm_head.weight": "model-00002-of-00002.safetensors",
        "model.embed_tokens.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.down_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.down_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.gate_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.gate_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.up_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.up_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.0.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.k_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.k_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.o_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.o_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.q_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.q_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.v_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.v_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.1.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.down_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.down_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.gate_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.gate_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.up_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.up_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.1.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.k_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.k_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.o_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.o_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.q_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.q_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.v_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.v_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.10.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.down_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.down_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.gate_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.gate_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.up_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.up_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.10.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.k_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.k_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.o_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.o_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.q_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.q_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.v_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.v_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.11.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.down_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.down_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.gate_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.gate_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.up_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.up_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.11.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.k_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.k_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.o_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.o_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.q_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.q_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.v_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.v_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.12.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.down_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.down_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.gate_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.gate_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.up_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.up_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.12.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.k_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.k_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.o_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.o_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.q_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.q_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.v_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.v_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.13.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.down_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.down_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.gate_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.gate_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.up_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.up_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.13.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.k_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.k_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.o_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.o_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.q_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.q_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.v_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.v_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.14.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.down_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.down_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.gate_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.gate_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.up_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.up_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.14.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.k_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.k_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.o_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.o_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.q_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.q_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.v_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.v_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.15.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.down_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.down_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.gate_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.gate_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.up_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.up_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.15.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.k_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.k_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.o_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.o_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.q_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.q_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.v_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.v_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.16.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.down_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.down_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.gate_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.gate_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.up_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.up_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.16.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.k_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.k_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.o_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.o_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.q_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.q_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.v_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.v_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.17.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.down_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.down_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.gate_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.gate_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.up_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.up_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.17.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.k_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.k_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.o_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.o_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.q_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.q_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.v_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.v_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.18.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.down_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.down_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.gate_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.gate_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.up_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.mlp.up_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.18.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.self_attn.k_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.k_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.o_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.18.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.self_attn.o_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.18.self_attn.q_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.q_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.v_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.18.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.18.self_attn.v_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.19.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.down_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.down_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.gate_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.gate_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.up_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.mlp.up_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.19.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.self_attn.k_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.19.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.self_attn.k_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.19.self_attn.o_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.19.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.self_attn.o_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.19.self_attn.q_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.19.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.self_attn.q_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.19.self_attn.v_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.19.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.19.self_attn.v_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.2.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.down_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.down_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.gate_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.gate_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.up_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.up_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.2.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.k_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.k_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.o_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.o_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.q_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.q_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.v_proj.input_scale": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.v_proj.weight_scale": "model-00001-of-00002.safetensors",
        "model.layers.20.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.20.mlp.down_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.20.mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.20.mlp.down_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.20.mlp.gate_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.20.mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.20.mlp.gate_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.20.mlp.up_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.20.mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.20.mlp.up_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.20.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.20.self_attn.k_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.20.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.20.self_attn.k_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.20.self_attn.o_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.20.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.20.self_attn.o_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.20.self_attn.q_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.20.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.20.self_attn.q_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.20.self_attn.v_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.20.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.20.self_attn.v_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.21.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.21.mlp.down_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.21.mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.21.mlp.down_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.21.mlp.gate_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.21.mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.21.mlp.gate_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.21.mlp.up_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.21.mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.21.mlp.up_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.21.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.21.self_attn.k_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.21.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.21.self_attn.k_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.21.self_attn.o_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.21.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.21.self_attn.o_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.21.self_attn.q_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.21.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.21.self_attn.q_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.21.self_attn.v_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.21.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.21.self_attn.v_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.22.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.22.mlp.down_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.22.mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.22.mlp.down_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.22.mlp.gate_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.22.mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.22.mlp.gate_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.22.mlp.up_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.22.mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.22.mlp.up_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.22.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.22.self_attn.k_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.22.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.22.self_attn.k_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.22.self_attn.o_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.22.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.22.self_attn.o_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.22.self_attn.q_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.22.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.22.self_attn.q_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.22.self_attn.v_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.22.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.22.self_attn.v_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.23.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.23.mlp.down_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.23.mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.23.mlp.down_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.23.mlp.gate_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.23.mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.23.mlp.gate_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.23.mlp.up_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.23.mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.23.mlp.up_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.23.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.23.self_attn.k_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.23.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.23.self_attn.k_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.23.self_attn.o_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.23.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.23.self_attn.o_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.23.self_attn.q_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.23.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.23.self_attn.q_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.23.self_attn.v_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.23.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.23.self_attn.v_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.24.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.down_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.down_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.gate_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.gate_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.up_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.up_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.24.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.k_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.k_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.o_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.o_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.q_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.q_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.v_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.v_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.25.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.down_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.down_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.gate_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.gate_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.up_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.up_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.25.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.k_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.k_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.o_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.o_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.q_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.q_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.v_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.v_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.26.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.down_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.down_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.gate_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.gate_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.up_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.up_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.26.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.k_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.k_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.o_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.o_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.q_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.q_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.v_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.v_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.27.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.down_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.down_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.gate_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.gate_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.up_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.up_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.27.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.k_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.k_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.o_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.o_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.q_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.q_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.v_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.v_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.28.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.28.mlp.down_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.28.mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.28.mlp.down_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.28.mlp.gate_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.28.mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.28.mlp.gate_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.28.mlp.up_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.28.mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.28.mlp.up_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.28.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.28.self_attn.k_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.28.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.28.self_attn.k_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.28.self_attn.o_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.28.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.28.self_attn.o_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.28.self_attn.q_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.28.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.28.self_attn.q_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.28.self_attn.v_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.28.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.28.self_attn.v_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.29.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.29.mlp.down_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.29.mlp.down_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.29.mlp.down_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.29.mlp.gate_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.29.mlp.gate_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.29.mlp.gate_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.29.mlp.up_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.29.mlp.up_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.29.mlp.up_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.29.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.29.self_attn.k_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.29.self_attn.k_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.29.self_attn.k_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.29.self_attn.o_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.29.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.29.self_attn.o_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.29.self_attn.q_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.29.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.29.self_attn.q_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.29.self_attn.v_proj.input_scale": "model-00002-of-00002.safetensors",
        "model.layers.29.self_attn.v_proj.weight": "model-00002-of-00002.safetensors",
        "model.layers.29.self_attn.v_proj.weight_scale": "model-00002-of-00002.safetensors",
        "model.layers.3.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.down_proj.input_scale": "model-00001-of-00002.safetensors",
