{
  "files": {
    "config.json": {
      "architectures": [
        "Qwen2ForCausalLM"
      ],
      "attention_dropout": 0.0,
      "bos_token_id": 151643,
      "eos_token_id": 151645,
      "hidden_act": "silu",
      "hidden_size": 3584,
      "initializer_range": 0.02,
      "intermediate_size": 18944,
      "max_position_embeddings": 32768,
      "max_window_layers": 28,
      "model_type": "qwen2",
      "num_attention_heads": 28,
      "num_hidden_layers": 28,
      "num_key_value_heads": 4,
      "quantization_config": {
        "bits": 4,
        "group_size": 128,
        "modules_to_not_convert": null,
        "quant_method": "awq",
        "version": "gemm",
        "zero_point": true
      },
      "rms_norm_eps": 1e-06,
      "rope_theta": 1000000.0,
      "sliding_window": 131072,
      "tie_word_embeddings": false,
      "torch_dtype": "float16",
      "transformers_version": "4.41.1",
      "use_cache": true,
      "use_sliding_window": false,
      "vocab_size": 152064
    },
    "model.safetensors.index.json": {
      "metadata": {
        "total_size": 5570747392
      },
      "weight_map": {
        "lm_head.weight": "model-00002-of-00002.safetensors",
        "model.embed_tokens.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.0.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.0.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.0.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.1.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.1.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.10.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.10.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.10.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.10.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.11.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.11.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.11.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.11.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.12.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.12.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.12.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.12.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.13.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.13.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.13.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.13.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.14.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.14.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.14.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.14.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.15.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.15.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.15.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.15.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.16.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.16.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.16.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.16.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.17.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.17.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.17.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.17.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.18.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.18.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.18.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.18.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.18.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.18.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.18.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.18.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.18.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.18.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.18.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.18.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.19.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.19.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.19.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.19.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.19.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.19.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.19.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.19.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.19.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.19.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.19.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.19.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.19.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.19.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.19.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.19.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.19.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.19.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.19.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.19.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.19.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.19.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.19.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.19.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.19.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.19.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.2.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.2.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.2.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.2.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.20.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.20.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.20.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.20.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.20.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.20.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.20.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.20.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.20.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.20.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.20.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.20.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.20.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.20.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.20.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.20.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.20.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.20.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.20.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.20.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.20.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.20.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.20.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.20.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.20.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.20.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.21.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.21.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.21.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.21.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.21.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.21.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.21.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.21.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.21.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.21.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.21.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.21.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.21.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.21.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.21.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.21.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.21.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.21.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.21.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.21.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.21.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.21.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.21.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.21.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.21.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.21.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.22.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.22.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.22.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.22.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.22.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.22.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.22.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.22.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.22.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.22.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.22.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.22.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.22.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.22.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.22.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.22.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.22.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.22.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.22.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.22.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.22.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.22.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.22.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.22.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.22.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.22.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.23.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.23.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.23.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.23.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.23.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.23.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.23.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.23.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.23.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.23.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.23.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.23.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.23.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.23.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.23.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.23.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.23.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.23.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.23.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.23.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.23.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.23.self_attn.q_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.23.self_attn.v_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.23.self_attn.v_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.23.self_attn.v_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.23.self_attn.v_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.24.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.down_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.down_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.gate_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.gate_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.up_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.up_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.24.mlp.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.24.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.k_proj.bias": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.k_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.k_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.k_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.o_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.o_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.o_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.q_proj.bias": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.q_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.q_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.q_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.v_proj.bias": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.v_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.v_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.24.self_attn.v_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.25.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.down_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.down_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.gate_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.gate_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.up_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.up_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.25.mlp.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.25.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.k_proj.bias": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.k_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.k_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.k_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.o_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.o_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.o_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.q_proj.bias": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.q_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.q_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.q_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.v_proj.bias": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.v_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.v_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.25.self_attn.v_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.26.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.down_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.down_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.gate_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.gate_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.up_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.up_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.26.mlp.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.26.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.k_proj.bias": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.k_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.k_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.k_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.o_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.o_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.o_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.q_proj.bias": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.q_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.q_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.q_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.v_proj.bias": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.v_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.v_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.26.self_attn.v_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.27.input_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.down_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.down_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.down_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.gate_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.gate_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.gate_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.up_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.up_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.27.mlp.up_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.27.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.k_proj.bias": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.k_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.k_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.k_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.o_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.o_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.o_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.q_proj.bias": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.q_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.q_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.q_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.v_proj.bias": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.v_proj.qweight": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.v_proj.qzeros": "model-00002-of-00002.safetensors",
        "model.layers.27.self_attn.v_proj.scales": "model-00002-of-00002.safetensors",
        "model.layers.3.input_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.down_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.down_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.down_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.gate_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.gate_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.gate_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.up_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.up_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.3.mlp.up_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.3.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
        "model.layers.3.self_attn.k_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.3.self_attn.k_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.3.self_attn.k_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.3.self_attn.k_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.3.self_attn.o_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.3.self_attn.o_proj.qzeros": "model-00001-of-00002.safetensors",
        "model.layers.3.self_attn.o_proj.scales": "model-00001-of-00002.safetensors",
        "model.layers.3.self_attn.q_proj.bias": "model-00001-of-00002.safetensors",
        "model.layers.3.self_attn.q_proj.qweight": "model-00001-of-00002.safetensors",
        "model.layers.3.self_attn.q_proj.qzeros": "model-00001-of-00002.safetensors",
