{
  "files": {
    "model_index.json": {
      "_class_name": "WanPipeline",
      "_diffusers_version": "0.35.0.dev0",
      "boundary_ratio": 0.875,
      "scheduler": [
        "diffusers",
        "UniPCMultistepScheduler"
      ],
      "text_encoder": [
        "transformers",
        "UMT5EncoderModel"
      ],
      "tokenizer": [
        "transformers",
        "T5TokenizerFast"
      ],
      "transformer": [
        "diffusers",
        "WanTransformer3DModel"
      ],
      "transformer_2": [
        "diffusers",
        "WanTransformer3DModel"
      ],
      "vae": [
        "diffusers",
        "AutoencoderKLWan"
      ]
    },
    "text_encoder/config.json": {
      "_name_or_path": "google/umt5-xxl",
      "architectures": [
        "UMT5EncoderModel"
      ],
      "classifier_dropout": 0.0,
      "d_ff": 10240,
      "d_kv": 64,
      "d_model": 4096,
      "decoder_start_token_id": 0,
      "dense_act_fn": "gelu_new",
      "dropout_rate": 0.1,
      "eos_token_id": 1,
      "feed_forward_proj": "gated-gelu",
      "initializer_factor": 1.0,
      "is_encoder_decoder": true,
      "is_gated_act": true,
      "layer_norm_epsilon": 1e-06,
      "model_type": "umt5",
      "num_decoder_layers": 24,
      "num_heads": 64,
      "num_layers": 24,
      "output_past": true,
      "pad_token_id": 0,
      "relative_attention_max_distance": 128,
      "relative_attention_num_buckets": 32,
      "scalable_attention": true,
      "tie_word_embeddings": false,
      "tokenizer_class": "T5Tokenizer",
      "torch_dtype": "bfloat16",
      "transformers_version": "4.48.0.dev0",
      "use_cache": true,
      "vocab_size": 256384
    },
    "text_encoder/model.safetensors.index.json": {
      "metadata": {
        "total_size": 11361820672
      },
      "weight_map": {
        "encoder.block.0.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
        "encoder.block.0.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
        "encoder.block.0.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
        "encoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight": "model-00001-of-00003.safetensors",
        "encoder.block.0.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
        "encoder.block.0.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
        "encoder.block.0.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00003.safetensors",
        "encoder.block.0.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00003.safetensors",
        "encoder.block.0.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
        "encoder.block.0.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
        "encoder.block.1.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
        "encoder.block.1.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
        "encoder.block.1.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
        "encoder.block.1.layer.0.SelfAttention.relative_attention_bias.weight": "model-00001-of-00003.safetensors",
        "encoder.block.1.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
        "encoder.block.1.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
        "encoder.block.1.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00003.safetensors",
        "encoder.block.1.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00003.safetensors",
        "encoder.block.1.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
        "encoder.block.1.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
        "encoder.block.10.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
        "encoder.block.10.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
        "encoder.block.10.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
        "encoder.block.10.layer.0.SelfAttention.relative_attention_bias.weight": "model-00002-of-00003.safetensors",
        "encoder.block.10.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
        "encoder.block.10.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.10.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00003.safetensors",
        "encoder.block.10.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00003.safetensors",
        "encoder.block.10.layer.1.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
        "encoder.block.10.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.11.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
        "encoder.block.11.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
        "encoder.block.11.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
        "encoder.block.11.layer.0.SelfAttention.relative_attention_bias.weight": "model-00002-of-00003.safetensors",
        "encoder.block.11.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
        "encoder.block.11.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.11.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00003.safetensors",
        "encoder.block.11.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00003.safetensors",
        "encoder.block.11.layer.1.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
        "encoder.block.11.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.12.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
        "encoder.block.12.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
        "encoder.block.12.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
        "encoder.block.12.layer.0.SelfAttention.relative_attention_bias.weight": "model-00002-of-00003.safetensors",
        "encoder.block.12.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
        "encoder.block.12.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.12.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00003.safetensors",
        "encoder.block.12.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00003.safetensors",
        "encoder.block.12.layer.1.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
        "encoder.block.12.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.13.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
        "encoder.block.13.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
        "encoder.block.13.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
        "encoder.block.13.layer.0.SelfAttention.relative_attention_bias.weight": "model-00002-of-00003.safetensors",
        "encoder.block.13.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
        "encoder.block.13.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.13.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00003.safetensors",
        "encoder.block.13.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00003.safetensors",
        "encoder.block.13.layer.1.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
        "encoder.block.13.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.14.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
        "encoder.block.14.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
        "encoder.block.14.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
        "encoder.block.14.layer.0.SelfAttention.relative_attention_bias.weight": "model-00002-of-00003.safetensors",
        "encoder.block.14.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
        "encoder.block.14.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.14.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00003.safetensors",
        "encoder.block.14.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00003.safetensors",
        "encoder.block.14.layer.1.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
        "encoder.block.14.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.15.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
        "encoder.block.15.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
        "encoder.block.15.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
        "encoder.block.15.layer.0.SelfAttention.relative_attention_bias.weight": "model-00002-of-00003.safetensors",
        "encoder.block.15.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
        "encoder.block.15.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.15.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00003.safetensors",
        "encoder.block.15.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00003.safetensors",
        "encoder.block.15.layer.1.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
        "encoder.block.15.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.16.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
        "encoder.block.16.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
        "encoder.block.16.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
        "encoder.block.16.layer.0.SelfAttention.relative_attention_bias.weight": "model-00002-of-00003.safetensors",
        "encoder.block.16.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
        "encoder.block.16.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.16.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00003.safetensors",
        "encoder.block.16.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00003.safetensors",
        "encoder.block.16.layer.1.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
        "encoder.block.16.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.17.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
        "encoder.block.17.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
        "encoder.block.17.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
        "encoder.block.17.layer.0.SelfAttention.relative_attention_bias.weight": "model-00002-of-00003.safetensors",
        "encoder.block.17.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
        "encoder.block.17.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.17.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00003.safetensors",
        "encoder.block.17.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00003.safetensors",
        "encoder.block.17.layer.1.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
        "encoder.block.17.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.18.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
        "encoder.block.18.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
        "encoder.block.18.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
        "encoder.block.18.layer.0.SelfAttention.relative_attention_bias.weight": "model-00002-of-00003.safetensors",
        "encoder.block.18.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
        "encoder.block.18.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.18.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00003.safetensors",
        "encoder.block.18.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00003.safetensors",
        "encoder.block.18.layer.1.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
        "encoder.block.18.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.19.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
        "encoder.block.19.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
        "encoder.block.19.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
        "encoder.block.19.layer.0.SelfAttention.relative_attention_bias.weight": "model-00002-of-00003.safetensors",
        "encoder.block.19.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
        "encoder.block.19.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.19.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00003.safetensors",
        "encoder.block.19.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00003.safetensors",
        "encoder.block.19.layer.1.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
        "encoder.block.19.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.2.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
        "encoder.block.2.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
        "encoder.block.2.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
        "encoder.block.2.layer.0.SelfAttention.relative_attention_bias.weight": "model-00001-of-00003.safetensors",
        "encoder.block.2.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
        "encoder.block.2.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
        "encoder.block.2.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00003.safetensors",
        "encoder.block.2.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00003.safetensors",
        "encoder.block.2.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
        "encoder.block.2.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
        "encoder.block.20.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
        "encoder.block.20.layer.0.SelfAttention.o.weight": "model-00003-of-00003.safetensors",
        "encoder.block.20.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
        "encoder.block.20.layer.0.SelfAttention.relative_attention_bias.weight": "model-00003-of-00003.safetensors",
        "encoder.block.20.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
        "encoder.block.20.layer.0.layer_norm.weight": "model-00003-of-00003.safetensors",
        "encoder.block.20.layer.1.DenseReluDense.wi_0.weight": "model-00003-of-00003.safetensors",
        "encoder.block.20.layer.1.DenseReluDense.wi_1.weight": "model-00003-of-00003.safetensors",
        "encoder.block.20.layer.1.DenseReluDense.wo.weight": "model-00003-of-00003.safetensors",
        "encoder.block.20.layer.1.layer_norm.weight": "model-00003-of-00003.safetensors",
        "encoder.block.21.layer.0.SelfAttention.k.weight": "model-00003-of-00003.safetensors",
        "encoder.block.21.layer.0.SelfAttention.o.weight": "model-00003-of-00003.safetensors",
        "encoder.block.21.layer.0.SelfAttention.q.weight": "model-00003-of-00003.safetensors",
        "encoder.block.21.layer.0.SelfAttention.relative_attention_bias.weight": "model-00003-of-00003.safetensors",
        "encoder.block.21.layer.0.SelfAttention.v.weight": "model-00003-of-00003.safetensors",
        "encoder.block.21.layer.0.layer_norm.weight": "model-00003-of-00003.safetensors",
        "encoder.block.21.layer.1.DenseReluDense.wi_0.weight": "model-00003-of-00003.safetensors",
        "encoder.block.21.layer.1.DenseReluDense.wi_1.weight": "model-00003-of-00003.safetensors",
        "encoder.block.21.layer.1.DenseReluDense.wo.weight": "model-00003-of-00003.safetensors",
        "encoder.block.21.layer.1.layer_norm.weight": "model-00003-of-00003.safetensors",
        "encoder.block.22.layer.0.SelfAttention.k.weight": "model-00003-of-00003.safetensors",
        "encoder.block.22.layer.0.SelfAttention.o.weight": "model-00003-of-00003.safetensors",
        "encoder.block.22.layer.0.SelfAttention.q.weight": "model-00003-of-00003.safetensors",
        "encoder.block.22.layer.0.SelfAttention.relative_attention_bias.weight": "model-00003-of-00003.safetensors",
        "encoder.block.22.layer.0.SelfAttention.v.weight": "model-00003-of-00003.safetensors",
        "encoder.block.22.layer.0.layer_norm.weight": "model-00003-of-00003.safetensors",
        "encoder.block.22.layer.1.DenseReluDense.wi_0.weight": "model-00003-of-00003.safetensors",
        "encoder.block.22.layer.1.DenseReluDense.wi_1.weight": "model-00003-of-00003.safetensors",
        "encoder.block.22.layer.1.DenseReluDense.wo.weight": "model-00003-of-00003.safetensors",
        "encoder.block.22.layer.1.layer_norm.weight": "model-00003-of-00003.safetensors",
        "encoder.block.23.layer.0.SelfAttention.k.weight": "model-00003-of-00003.safetensors",
        "encoder.block.23.layer.0.SelfAttention.o.weight": "model-00003-of-00003.safetensors",
        "encoder.block.23.layer.0.SelfAttention.q.weight": "model-00003-of-00003.safetensors",
        "encoder.block.23.layer.0.SelfAttention.relative_attention_bias.weight": "model-00003-of-00003.safetensors",
        "encoder.block.23.layer.0.SelfAttention.v.weight": "model-00003-of-00003.safetensors",
        "encoder.block.23.layer.0.layer_norm.weight": "model-00003-of-00003.safetensors",
        "encoder.block.23.layer.1.DenseReluDense.wi_0.weight": "model-00003-of-00003.safetensors",
        "encoder.block.23.layer.1.DenseReluDense.wi_1.weight": "model-00003-of-00003.safetensors",
        "encoder.block.23.layer.1.DenseReluDense.wo.weight": "model-00003-of-00003.safetensors",
        "encoder.block.23.layer.1.layer_norm.weight": "model-00003-of-00003.safetensors",
        "encoder.block.3.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
        "encoder.block.3.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
        "encoder.block.3.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
        "encoder.block.3.layer.0.SelfAttention.relative_attention_bias.weight": "model-00001-of-00003.safetensors",
        "encoder.block.3.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
        "encoder.block.3.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
        "encoder.block.3.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00003.safetensors",
        "encoder.block.3.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00003.safetensors",
        "encoder.block.3.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
        "encoder.block.3.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
        "encoder.block.4.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
        "encoder.block.4.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
        "encoder.block.4.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
        "encoder.block.4.layer.0.SelfAttention.relative_attention_bias.weight": "model-00001-of-00003.safetensors",
        "encoder.block.4.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
        "encoder.block.4.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
        "encoder.block.4.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00003.safetensors",
        "encoder.block.4.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00003.safetensors",
        "encoder.block.4.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
        "encoder.block.4.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
        "encoder.block.5.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
        "encoder.block.5.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
        "encoder.block.5.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
        "encoder.block.5.layer.0.SelfAttention.relative_attention_bias.weight": "model-00001-of-00003.safetensors",
        "encoder.block.5.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
        "encoder.block.5.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
        "encoder.block.5.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00003.safetensors",
        "encoder.block.5.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00003.safetensors",
        "encoder.block.5.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
        "encoder.block.5.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
        "encoder.block.6.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
        "encoder.block.6.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
        "encoder.block.6.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
        "encoder.block.6.layer.0.SelfAttention.relative_attention_bias.weight": "model-00001-of-00003.safetensors",
        "encoder.block.6.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
        "encoder.block.6.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
        "encoder.block.6.layer.1.DenseReluDense.wi_0.weight": "model-00001-of-00003.safetensors",
        "encoder.block.6.layer.1.DenseReluDense.wi_1.weight": "model-00001-of-00003.safetensors",
        "encoder.block.6.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
        "encoder.block.6.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
        "encoder.block.7.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
        "encoder.block.7.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
        "encoder.block.7.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
        "encoder.block.7.layer.0.SelfAttention.relative_attention_bias.weight": "model-00001-of-00003.safetensors",
        "encoder.block.7.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
        "encoder.block.7.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
        "encoder.block.7.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00003.safetensors",
        "encoder.block.7.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00003.safetensors",
        "encoder.block.7.layer.1.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
        "encoder.block.7.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.8.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
        "encoder.block.8.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
        "encoder.block.8.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
        "encoder.block.8.layer.0.SelfAttention.relative_attention_bias.weight": "model-00002-of-00003.safetensors",
        "encoder.block.8.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
        "encoder.block.8.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.8.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00003.safetensors",
        "encoder.block.8.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00003.safetensors",
        "encoder.block.8.layer.1.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
        "encoder.block.8.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.9.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
        "encoder.block.9.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
        "encoder.block.9.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
        "encoder.block.9.layer.0.SelfAttention.relative_attention_bias.weight": "model-00002-of-00003.safetensors",
        "encoder.block.9.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
        "encoder.block.9.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.block.9.layer.1.DenseReluDense.wi_0.weight": "model-00002-of-00003.safetensors",
        "encoder.block.9.layer.1.DenseReluDense.wi_1.weight": "model-00002-of-00003.safetensors",
        "encoder.block.9.layer.1.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
        "encoder.block.9.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
        "encoder.final_layer_norm.weight": "model-00003-of-00003.safetensors",
        "shared.weight": "model-00001-of-00003.safetensors"
      }
    },
    "transformer/config.json": {
      "_class_name": "WanTransformer3DModel",
      "_diffusers_version": "0.35.0.dev0",
      "added_kv_proj_dim": null,
      "attention_head_dim": 128,
      "cross_attn_norm": true,
      "eps": 1e-06,
      "ffn_dim": 13824,
      "freq_dim": 256,
      "image_dim": null,
      "in_channels": 16,
      "num_attention_heads": 40,
      "num_layers": 40,
      "out_channels": 16,
      "patch_size": [
        1,
        2,
        2
      ],
      "pos_embed_seq_len": null,
      "qk_norm": "rms_norm_across_heads",
      "rope_max_seq_len": 1024,
      "text_dim": 4096
    },
    "transformer/diffusion_pytorch_model.safetensors.index.json": {
      "metadata": {
        "total_size": 57153966336
      },
      "weight_map": {
        "blocks.0.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.norm2.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.norm2.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.0.scale_shift_table": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn1.norm_k.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn1.norm_q.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn1.to_k.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn1.to_k.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn1.to_out.0.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn1.to_out.0.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn1.to_q.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn1.to_q.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn1.to_v.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn1.to_v.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn2.norm_k.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn2.norm_q.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn2.to_k.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn2.to_k.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn2.to_out.0.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn2.to_out.0.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn2.to_q.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn2.to_q.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn2.to_v.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.attn2.to_v.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.ffn.net.0.proj.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.ffn.net.0.proj.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.ffn.net.2.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.ffn.net.2.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.norm2.bias": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.norm2.weight": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.1.scale_shift_table": "diffusion_pytorch_model-00001-of-00012.safetensors",
        "blocks.10.attn1.norm_k.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn1.norm_q.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn1.to_k.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn1.to_k.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn1.to_out.0.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn1.to_out.0.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn1.to_q.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn1.to_q.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn1.to_v.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn1.to_v.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn2.norm_k.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn2.norm_q.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn2.to_k.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn2.to_k.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn2.to_out.0.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn2.to_out.0.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn2.to_q.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn2.to_q.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn2.to_v.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.attn2.to_v.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.ffn.net.0.proj.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.ffn.net.0.proj.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.ffn.net.2.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.ffn.net.2.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.norm2.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.norm2.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.10.scale_shift_table": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn1.norm_k.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn1.norm_q.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn1.to_k.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn1.to_k.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn1.to_out.0.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn1.to_out.0.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn1.to_q.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn1.to_q.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn1.to_v.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn1.to_v.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn2.norm_k.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn2.norm_q.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn2.to_k.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn2.to_k.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn2.to_out.0.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn2.to_out.0.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn2.to_q.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn2.to_q.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn2.to_v.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.attn2.to_v.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.ffn.net.0.proj.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.ffn.net.0.proj.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.ffn.net.2.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.ffn.net.2.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.norm2.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.norm2.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.11.scale_shift_table": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn1.norm_k.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn1.norm_q.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn1.to_k.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn1.to_k.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn1.to_out.0.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn1.to_out.0.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn1.to_q.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn1.to_q.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn1.to_v.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn1.to_v.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn2.norm_k.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn2.norm_q.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn2.to_k.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn2.to_k.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn2.to_out.0.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn2.to_out.0.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn2.to_q.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn2.to_q.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn2.to_v.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.attn2.to_v.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.ffn.net.0.proj.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.ffn.net.0.proj.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.ffn.net.2.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.ffn.net.2.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.norm2.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.norm2.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.12.scale_shift_table": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.13.attn1.norm_k.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.13.attn1.norm_q.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.13.attn1.to_k.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.13.attn1.to_k.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.13.attn1.to_out.0.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.13.attn1.to_out.0.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.13.attn1.to_q.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.13.attn1.to_q.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.13.attn1.to_v.bias": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.13.attn1.to_v.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.13.attn2.norm_k.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.13.attn2.norm_q.weight": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.13.attn2.to_k.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.13.attn2.to_k.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.13.attn2.to_out.0.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.13.attn2.to_out.0.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.13.attn2.to_q.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.13.attn2.to_q.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.13.attn2.to_v.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.13.attn2.to_v.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.13.ffn.net.0.proj.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.13.ffn.net.0.proj.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.13.ffn.net.2.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.13.ffn.net.2.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.13.norm2.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.13.norm2.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.13.scale_shift_table": "diffusion_pytorch_model-00004-of-00012.safetensors",
        "blocks.14.attn1.norm_k.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn1.norm_q.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn1.to_k.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn1.to_k.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn1.to_out.0.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn1.to_out.0.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn1.to_q.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn1.to_q.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn1.to_v.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn1.to_v.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn2.norm_k.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn2.norm_q.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn2.to_k.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn2.to_k.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn2.to_out.0.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn2.to_out.0.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn2.to_q.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn2.to_q.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn2.to_v.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.attn2.to_v.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.ffn.net.0.proj.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.ffn.net.0.proj.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.ffn.net.2.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.ffn.net.2.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.norm2.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.norm2.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.14.scale_shift_table": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn1.norm_k.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn1.norm_q.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn1.to_k.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn1.to_k.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn1.to_out.0.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn1.to_out.0.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn1.to_q.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn1.to_q.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn1.to_v.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn1.to_v.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn2.norm_k.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn2.norm_q.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn2.to_k.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn2.to_k.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn2.to_out.0.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn2.to_out.0.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn2.to_q.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn2.to_q.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn2.to_v.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.attn2.to_v.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.ffn.net.0.proj.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.ffn.net.0.proj.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.ffn.net.2.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.ffn.net.2.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.norm2.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.norm2.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.15.scale_shift_table": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn1.norm_k.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn1.norm_q.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn1.to_k.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn1.to_k.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn1.to_out.0.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn1.to_out.0.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn1.to_q.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn1.to_q.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn1.to_v.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn1.to_v.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn2.norm_k.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn2.norm_q.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn2.to_k.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn2.to_k.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn2.to_out.0.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn2.to_out.0.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn2.to_q.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn2.to_q.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn2.to_v.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.attn2.to_v.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.ffn.net.0.proj.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.ffn.net.0.proj.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.ffn.net.2.bias": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.16.ffn.net.2.weight": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.16.norm2.bias": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.norm2.weight": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.16.scale_shift_table": "diffusion_pytorch_model-00005-of-00012.safetensors",
        "blocks.17.attn1.norm_k.weight": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.17.attn1.norm_q.weight": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.17.attn1.to_k.bias": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.17.attn1.to_k.weight": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.17.attn1.to_out.0.bias": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.17.attn1.to_out.0.weight": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.17.attn1.to_q.bias": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.17.attn1.to_q.weight": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.17.attn1.to_v.bias": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.17.attn1.to_v.weight": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.17.attn2.norm_k.weight": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.17.attn2.norm_q.weight": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.17.attn2.to_k.bias": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.17.attn2.to_k.weight": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.17.attn2.to_out.0.bias": "diffusion_pytorch_model-00006-of-00012.safetensors",
        "blocks.17.attn2.to_out.0.weight": "diffusion_pytorch_model-00006-of-00012.safetensors",
